//
// Created by divan on 10/6/23.
//
#include <iostream>

using namespace std;

void encrypt(char *arr, int len, int x) {
    for (int i = 0; i < len; i++) {
        if (isalpha(arr[i])) {
            char base = islower(arr[i]) ? 'a' : 'A';
            *(arr + i) = (*(arr + i) - base + x) % 26 + base;
        }
    }
}


void decrypt(char *arr, int len, int x) {
    encrypt(arr, len, 26 - (x % 26));
}

int main() {
    char operation;
    int len, x;

    while (true) {
        cout << "Выберите операцию:\ne - шифрование\nd - дешифрование\nq - выход" << endl;
        cin >> operation;

        if (operation == 'q') break;
        else if (operation != 'e' && operation != 'd' && operation != 'q') {
            cout << "Неверная операция. Попробуйте еще раз." << endl;
            continue;
        }
        cout << "Введите длину строки: ";
        cin >> len;
        char arr[len];

        cout << "Введите строку: ";
        cin >> arr;

        cout << "Введите количество букв, на которое будем сдвигать: ";
        cin >> x;

        if (operation == 'e') {
            encrypt(arr, len, x);
        } else if (operation == 'd') {
            decrypt(arr, len, x);
        }

        cout << "Результат: " << arr << endl;
    }

    return 0;
}
// Реализуйте шифр Цезаря для следующего преобразования текста: каждая буква исходного текста заменяется буквой,
// стоящей на x символов впереди неё. Будем полагать что алфавит зацикленный, т.е. после буквы “z” идет буква “a”.
// Ваша программа должна будет уметь в зависимости от выбора пользователя зашифровать или дешифровать
// (т.е. восстановить исходный) текст, введённый с консоли, согласно шифру Цезаря, строчные символы на строчные,
// заглавные на заглавные.

// Входные данные: символ выбора операции (шифрование или дешифрование), длина строки, массив символов char arr[],
// целое число x – сдвиг шифра. Вводится строка без каких-либо неалфавитных символов.

// Символы в строке: a – z (строчные и заглавные).

// Неалфавитные символы: знаки препинания, пробелы, цифры, — не вводятся и, соответственно, не меняются.

// Выходные данные: преобразованная согласно шифру строка.

// Дополнительно в этой задаче вы можете с помощью цикла while поддержать повтор
// введения строки с возможностью закрыть программу, если вместо оператора введен иной заданный символ,
// а также дешифрование текста.